Revit 2024 API
Generic.GenericBumpMap Property
 The property labeled "Bump" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericBumpMap { get; }
Visual Basic
Public Shared ReadOnly Property GenericBumpMap As String
	Get
Visual C++
public:
static property String^ GenericBumpMap {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace